Revit 2027 API
Category.IsValid Property
Indicates if the Category is valid or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
public:
property bool IsValid {
	bool get ();
}
member IsValid : bool with get
Property Value
Boolean
Remarks
A valid Category is one which is present in the Document's Categories.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace